Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: Notice here we called the double function to create the first parameter to add.
ko: 여기서 우리가 add의 첫 번째 매개변수를 만들기 위해 double 함수를 호출한 것을 보세요.

source: Notice that (a : α) → β makes sense for any expression β : Type.
ko: (a : α) → β는 모든 식 β : Type에 대해 성립하는 것을 주목하세요.

source: Notice that cases can be used to produce data as well as prove propositions.
ko: cases는 데이터를 만드는 것만 아니라 명제를 증명하는 데에도 사용될 수 있음을 주목하세요.

source: Notice that a type with multiple constructors is disjunctive: an element of Sum α β is either of the form inl a or of the form inl b.
ko: 다수의 생성자가 있는 유형은 분리적임을 주목하세요. Sum α β의 원소는 inl a의 형태 또는 inl b의 형태입니다.

source: Notice that an existential proposition is very similar to a sigma type, as described in dependent types section.
ko: 존재 명제는 의존 유형론 섹션에서 설명했던 시그마 유형과 아주 비슷한 것을 보세요.

source: Notice that and-introduction and and-elimination are similar to the pairing and projection operations for the cartesian product.
ko: and-도입과 and-제거는 카테시안 곱 연산의 순서쌍을 구성하는 것과 순서쌍에서 원소를 추출하는 연산과 비슷한 것을 보세요.

source: Notice that applying a term t : α → β to a term s : α yields an expression t s : β.
ko: 항 t : α → β을 항 s : α에 적용하여 표현식 t s : β을 얻는 것을 보세요.

source: Notice that if α is any type, we can form the type α → Prop of all predicates on α (the "power type of α").
ko: 만약 α가 임의의 유형이면, 우리는 α에 대한 모든 술어에 대해 α → Prop형을 만들 수 있습니다. (" α형의 능력")

source: Notice that if α is any type, we can represent a unary predicate p on α as an object of type α → Prop.
ko: α 가 임의의 유형인지를 보세요, 우리는 α에 대해 단항 술어 p를 α → Prop형의 대상으로 나타낼 수 있습니다.

source: Notice that implicit arguments are inserted eagerly.
ko: 암시적인 인수는 간절히 삽입됨을 주의하세요.

source: Notice that now the first #check command gives the type of the identifier, id, without inserting any placeholders.
ko: 현재 첫 번째 #check 명령은 식별자 id의 유형을 어떤 플레이스 홀더도 삽입하지 않고 주는 것을 보세요.

source: Notice that the cons constructor takes an element of Vector α n and returns an element of Vector α (n+1), thereby using an element of one member of the family to build an element of another.
ko: cons 생성자는 Vector α n의 원소를 받고 Vector α (n+1)의 원소를 반환합니다. 그러므로 군의 한 구성원의 원소를 다른 원소를 만드는데 사용합니다.

source: Notice that the expression m + 3 * k is erased by generalize; all that matters is whether it is of the form 0 or succ a.
ko: 표현식 m + 3 * k은 generalize에 의해 지워짐을 보세요. 중요한 것은 0 혹은 succ a의 형태인지 아닌지 입니다.

source: Notice that the lambda abstractions hp : p and hq : q can be viewed as temporary assumptions in the proof of t1.
ko: 람다 추상화 hp : p과 hq : q은 t1의 증명에서 일시적인 가정으로 보일 수 있음을 주목하세요.

source: Notice that the last example specifies that the rewrite should take place on the right-hand side by specifying the second argument to Nat.add_comm.
ko: 마지막 예제는 Nat.add_comm의 두 번째 인수를 명시함으로써 우변에 다시쓰기가 있어야 합니다.

source: Notice that the meaning of the expression let a := t1; t2 is very similar to the meaning of (fun a => t2) t1, but the two are not the same.
ko: 표현식 let a := t1; t2의 의미는 (fun a => t2) t1의 의미와 아주 비슷함을 주목하세요. 그러나 이 둘은 같지는 않습니다.

source: Notice that the product type depends on parameters α β : Type which are arguments to the constructors as well as Prod.
ko: 곱 유형은 생성자와 Prod의 인수인 매개변수 α β : Type에 의존하였음을 주목하세요.

source: Notice that the second example and the last two examples require the assumption that there is at least one element a of type α.
ko: 두 번째 예제와 마지막 두 예제는 α형의 한 원소 a가 적어도 하나 있다는 가정을 필요로 한다는 것을 유의하세요.

source: Notice that the second implicit parameter to Eq.subst, which provides the context in which the substitution is to occur, has type α → Prop.
ko: 대체가 일어나는 곳에 대한 맥락을 제공하는 두번째 암시적 인수 Eq.subst이 α → Prop형을 가지는 것을 보세요.

source: Notice that there is enough information in the full expression for Lean to infer the types of hp and hq as well.
ko: hp와 hq의 유형을 추론하기에 린에게 완전한 표현식에 충분한 정보가 있음을 보세요.

source: Notice that we do not include the types α and β in the target of the constructors.
ko: 우리가 생성자의 대상에 α형과 β형을 포함하지 않은 것을 주목하세요.

source: Notice that, once again, when Nat.recOn is used in the context of a proof, it is really the induction principle in disguise.
ko: 다시 한 번 Nat.recOn은 증명의 맥락에서 사용됨을 주목하세요. 이는 정말로 귀납 원리가 위장한 것입니다.

source: Notice that, under the propositions-as-types correspondence, we can use match to prove theorems as well as define functions.
ko: 유형으로써 명제 대응 하에서 우리는 합수를 정의하는 것 뿐만 아니라 정리를 증명하는데 match를 사용합니다.

source: Now to get a bit more abstract, you can also specify arguments that are like type parameters:
ko: 이제 약간 더 추상적으로 갑시다. 여러분은 유형 매개변수같은 인수를 지정할 수도 있습니다.

source: Now we can apply the theorem t1 just as a function application.
ko: 이제 우리는 정리 t1을 함수 활용에 적용할 수 있습니다.

source: Now we populate the class with some instances:
ko: 이제 몇몇 개체로 클래스를 채우겠습니다.

source: Now, given that h has type ∀ x : α, p x ∧ q x, the expression h y has type p y ∧ q y.
ko: 이제 h가 ∀ x : α, p x ∧ q x형을 갖는다고 해봅시다. 그러면 표현식 h y는 p y ∧ q y형을 갖습니다.

source: Now, we explore another application.
ko: 여기서 우리는 다른 적용을 탐색합니다.

source: Now, we reveal how the notation a*b is defined in Lean.
ko: 이제 우리는 린에서 기호 a*b이 어떻게 정의되는지 드러냅니다.

source: Numerals
ko: 수치값(Numerals)

source: Numerals are overloaded in Lean, but when the type of a numeral cannot be inferred, Lean assumes, by default, that it is a natural number.
ko: 수치들은 Lean에 매우 많이 있습니다. 그러나 수치 유형이 추론되지 못할 때, 린은 기본적으로 그걸 자연수라고 가정합니다.

source: Numerals are polymorphic in Lean.
ko: 수치값들은 린에서 다형적입니다.

source: Objects
ko: 대상(개체, 객체)

source: Of course, a fundamental property of equality is that it is an equivalence relation:
ko: 물론 동등의 기초적인 성질은 등가 관계라는 것입니다.

source: Of course, it is unsound as a proof method -- for example, you can use it to prove False -- and Lean produces severe warnings when files use or import theorems which depend on it.
ko: 물론 증명 방법으로 건전하지 않습니다. -- 예를 들어, 여러분은 False 을 증명하는데 그것을 사용할 수 있습니다. --그러면 린은 그것에 의존하는 정리를 불러오거나 그런 파일을 사용할 때 심각한 경고를 보냅니다.

source: Of course, it would be highly cumbersome for users to manually pass the implementations around in this way.
ko: 당연히 이처럼 구현을 수동적으로 넘겨야 한다면 사용자에게 아주 성가실 것 입니다.

source: Of course, wildcards are allowed:
ko: 당연히 와일드카드도 허용됩니다.

source: Often proofs move from one fact to the next, so this can be effective in eliminating the clutter of lots of labels.
ko: 증명은 종종 한 사실에서 다음 사실로 이동하기 때문에 이것은 많은 이름으로 생기는 혼동을 없애는 데 효과적입니다.

source: Often the name of theorem simply describes the conclusion:
ko: 정리의 이름은 종종 결론을 설명합니다.

source: Often, when you import a module, you will want to open one or more of the namespaces it contains, to have access to the short identifiers.
ko: 짧은 식별자로 접근하기 위해서 종종 여러분이 모듈을 가져오기(import) 할 때, 모듈이 담은 다수의 이름공간을 열기 원할 것입니다.

source: On the assumption that decide p = true holds, of_decide_eq_true produces a proof of p.
ko: decide p = true가 성립한다고 가정하면 of_decide_eq_true는 p의 증명을 생성합니다.

source: On the other hand, #reduce fib <n> is efficient because it uses the definition sent to the kernel that is based on the brecOn construction.
ko: 다른 한편 #reduce fib <n>는 brecOn 생성자에 기반한 커널에 보내져 정의를 사용하기 때문에 효율적입니다.

source: On this basis, the standard library provides a default element, defaulty, of any inhabited type.
ko: 이 기초로부터 표준 라이브러리는 임의의 거주 유형에 대해 기본 원소 defaulty를 제공합니다.

source: Once again, we can use arithmetic notation, as in the version below.
ko: 다시 한 번 우리는 산술적 기호를 아래 버전에서 처럼 사용할 수 있습니다.

source: Once again, cases will revert, split, and then reintroduce depedencies in the context.
ko: 다시 한번, cases는 맥락의 종속물들을 되돌리고, 나누고, 재도입합니다.

source: Once again, it is the Curry-Howard isomorphism that allows us to co-opt this mechanism for writing proofs as well.
ko: 한 번 더 커리-하워드 동형은 우리가 증명을 작성하는 데에도 이 메커니즘과 함께 쓰이게 합니다.

source: Once again, using the propositions-as-types correspondence, the variable h of type r → s can be viewed as the hypothesis, or premise, that r → s holds.
ko: 다시 한 번, 유형으로써 명제 대응을 사용하면 r → s형의 변수 h는 r → s을 성립시키는 가정 또는 전제로 볼 수 있습니다.

source: Once again, you should exercise judgment as to whether such abbreviations enhance or diminish readability.
ko: 다시 한 번, 여러분은 그러한 간략화가 가독성을 높이는지 낮추는지 판단을 시험해보셔야 합니다.

source: Once again, you should try some examples on your own.
ko: 다시 한번 여러분 스스로 몇 가지 예제를 시도해보기 바랍니다.

source: Once arrived at the relevant target, we can use rw as in normal tactic mode.
ko: 일단 연관된 대상에 도달하면 일반 전략 모드처럼 rw를 사용할 수 있습니다.

source: Once the attribute is applied, however, there is no way to permanently remove it; it persists in any file that imports the one where the attribute is assigned.
ko: 그러나 한 번 이 특성이 적용되면 그 특성이 부여된 정리를 불러온 어떤 파일이든 지속되므로 영구적으로 이를 제거할 방법이 없습니다.

source: Once the proof of a theorem is complete, typically we only need to know that the proof exists; it doesn't matter what the proof is.
ko: 한번 정리의 증명이 마쳐지면 우리는 증명이 존재한다는 것만 알면 됩니다. 증명이 무엇인지 아는 것은 중요하지 않습니다.

source: One again, you can reduce the proof to:
ko: 다시한번 여러분은 증명을 다음과 같이 줄일 수 있습니다.

source: One can also assign the attribute any time after the definition takes place:
ko: 어떤 이는 이 정의를 만든 뒤 어느 때든지 특성을 부여할 수 있습니다.

source: One can also specify imports relative to the current directory; for example, Importing is transitive.
ko: 어떤 이는 현재 경로에 상대적으로 불러오기를 명시할 수 있습니다. 예를 들어 불러오는 것은 전이적입니다.

source: One can always specify the type T of an expression e by writing (e : T).
ko: 누군가는 표현식 e의 유형 T를 (e : T)와 같이 씀으로써 항상 명시할 수 있습니다.

source: One can shortcut it using pattern matching as follows:
ko: 누군가는 다음과 같이 패턴 매칭을 사용하여 그것을 손쉽게 할 수 있습니다.

source: One can show that the type TreeList α is isomorphic to List (Tree α), but translating results back and forth along this isomorphism is tedious.
ko: 어떤 이는 TreeList α형이 List (Tree α)과 i동형(somorphic)임을 보일 수 있습니다. 그러나 이 동형을 따라 결과를 앞뒤로 번역하는 것은 번거롭습니다.

source: One can similarly infer the argument in Lst.nil Nat, not from anything else in that expression, but from the fact that it is sent as an argument to the function Lst.cons, which expects an element of type Lst α in that position.
ko: 어떤 식으로부터도 아니고 Lst α형의 원소를 기대하는 Lst.cons 함수에 인수로 전달되었다는 사실로부터 누군가는 비슷하게 Lst.nil Nat에서 인수를 추론할 수 있습니다.

source: One consequence of the law of the excluded middle is the principle of double-negation elimination:
ko: 배중률의 한 결과는 이중 부정 제거의 원리입니다.

source: One example is the definition of Vector α n, the type of vectors of elements of α of length n:
ko: 한 예제는 길이 n의 α를 원소로 하는 벡터 유형 Vector α n의 정의입니다.

source: One solution is to define an auxiliary function:
ko: 우리의 방법은 부가적인 함수를 정의하는 것입니다.

source: One strategy for proving assertions about objects defined in the language of dependent type theory is to layer an assertion language and a proof language on top of the definition language.
ko: 의존 유형론의 언어로 정의된 객체에 대해서 주장을 증명하는 한 전략은 주장 언어와 증명 언어를 정의언어의 꼭대기 층에 두는 것입니다.

source: One thing that is nice about Lean's proof-writing syntax is that it is possible to mix term-style and tactic-style proofs, and pass between the two freely.
ko: Lean의 증명 작성 문법에 대해 좋은 점은 항 스타일과 전략 스타일의 증명을 섞고, 이들 사이를 자유로이 왕래할 수 있다는 것입니다.

source: One thing that makes the simplifier especially useful is that its capabilities can grow as a library develops.
ko: 단순화기를 특히 유용하게 만드는 한 가지는 그것의 능력이 라이브러리가 개발되어 감에 따라 증가한다는 것입니다.

source: One very useful family of options controls the way Lean's pretty- printer displays terms.
ko: 매우 유용한 옵션 모음 중 하나는 린의 pretty- printer가 항을 표시하는 방식을 제어합니다.

source: One way in which Lean's dependent type theory extends simple type theory is that types themselves --- entities like Nat and Bool --- are first-class citizens, which is to say that they themselves are objects.
ko: 린의 종속 유형론이 단순 유형론을 확장시키는 한 방법은 ---Nat과 Bool같은 개체는 그들 그 자체로 대상인 일등 시민 ---으로 두는 것입니다.

source: Open a namespace Hidden to avoid naming conflicts, and use the equation compiler to define addition, multiplication, and exponentiation on the natural numbers.
ko: 이름공간Hidden을 열어 이름 충돌을 피하세요. 그리고 방정식 컴파일러로 덧셈, 곱셈 그리고 거듭제곱을 자연수에 대해 정의하세요.

source: Option synthInstance.maxHeartbeats specifies the maximum amount of heartbeats per typeclass resolution problem.
ko: synthInstance.maxHeartbeats 옵션은 유형 클래스 해결 문제 당 최대 심박수 양을 지정합니다.

source: Option synthInstance.maxSize is the maximum number of instances used to construct a solution in the type class instance synthesis procedure.
ko: synthInstance.maxSize 옵션은 유형 클래스 개체 합성 절차에서 해을 만드는 데 사용되는 최대 개체수입니다.

source: Or
ko: 논리합

source: Or even this:
ko: 심지어 이렇게도 됩니다.

source: Or you can carry out a proof by contradiction:
ko: 한편 여러분은 귀류법으로 증명을 도출할 수 있습니다.

source: Ordinarily, you meet such a goal by writing an explicit term.
ko: 일반적으로 명시적인 항을 작성하여 이런 목표를 달성합니다.

source: Ordinary classical logic adds to this the law of the excluded middle, p ∨ ¬p.
ko: 평범한 고전 논리는 여기에 배중률 p ∨ ¬p을 추가합니다.

source: Other Recursive Data Types
ko: 다른 재귀적인 데이터 유형

source: Other properties:
ko: 다른 성질들:

source: Other systems provide search procedures and decision procedures for specific languages and domains, such as linear or nonlinear expressions over the integers or the real numbers.
ko: 다른 시스템들은 특정 언어와 영역에 대한 선형 혹은 비선형 식(가령 정수나 실수에 대해 정의된)들에 탐색 절차과 결정 절차를 제공합니다.

source: Other tactics inside conversion mode
ko: 전환 모드 속 다른 전략

source: Otherwise, v is of the form a :: w, and we can simply return w, after casting it from a vector of length m to a vector of length n.
ko: 그렇지 않으면 v는 a :: w꼴이고 길이 m의 벡터에서 길이 n의 벡터로 이를 바꾼 후에 우리는 단순히 w를 반환할 수 있습니다.

source: Output parameters
ko: 출력 매개변수

source: Outside the section, the simplifier will no longer use reverse_mk_symm by default.
ko: 섹션 바깥 쪽에서 단순화기는 기본적으로 reverse_mk_symm을 사용할 수 없게 될 것이다.

source: Parallel sequencing is one way to arrange it so that a single tactic is applied to multiple goals, but there are other ways to do this.
ko: 병렬은 이를 배열하는 한 방법이므로 하나의 전략이 다수의 목표에 적용될 수 있습니다. 그러나 이를 할 수 있는 다른 방식들이 있습니다.

source: Pattern Matching
ko: 패턴 매칭

source: Pattern matching
ko: 패턴 매칭

source: Pattern matching provides an approach that is more convenient, and familiar to users of functional programming languages.
ko: 패턴 매칭은 더 편리한 접근법과 함수형 프로그래밍 언어의 사용자에게 친숙한 접근법을 제공합니다.

source: Pattern matching can also be used to destruct inductively defined propositions:
ko: 패턴 매칭은 재귀적으로 정의된 명제를 파괴하는 데에도 사용될 수 있습니다.

source: Pattern matching works with any inductive type, such as products and option types:
ko: 패턴 매칭은 곱과 옵션 유형 같은 임의의 재귀형과 동작합니다.

source: Placeholders without precedence default to 0, i.e. they accept notations of any precedence in their place.
ko: 우선순위가 없는 자리차지자는 0으로 설정됩니다. 예를 들어 이들은 그들의 자리에 임의의 우선순위의 기호든 받습니다.

source: Please see lean prover and lean community for an up to date list of our amazing contributors.
ko: 합린 증명보조기와 린 커뮤니티에서 놀라운 최신 기여자 명단을 확인할 수 있습니다.

source: Pretty printing additional information is often very useful when you are debugging a proof, or trying to understand a cryptic error message.
ko: 깔끔한 출력하기의 추가 정보는 증명의 버그를 없앨때나 암호같은 오류 메시지를 이해하려고 할 때 아주 유용합니다.

source: Printing them out shows that all three groups of definitions have exactly the same effect.
ko: 이것을 출력하는 것은 세 정의 그룹이 정확히 동일한 효과를 가짐을 보여줍니다.

source: Priorities are also useful to control the interaction between different default instances.
ko: 우선 순위는 다른 기본 개체들 간의 상호작용을 제어하는 데에도 유용합니다.

source: Propositional Logic
ko: 명제 논리

source: Propositions as Types
ko: 유형으로써 명제

source: Prove ¬(p ↔ ¬p) without using classical logic.
ko: 고전 논리를 사용하지 않고 ¬(p ↔ ¬p)을 증명하세요.

source: Prove as many of the identities listed in the Existential Quantifier section as you can.
ko: 존재 정량자에서 수록된 항등식을 여러분이 할 수 있는 만큼 가능한 많이 증명해보세요.

source: Prove some properties, such as the following:
ko: 다음과 같은 몇 가지 성질을 증명하세요.

source: Prove that this is a contradiction:
ko: 이것이 모순임을 증명하세요.

source: Prove the following identities, replacing the "sorry" placeholders with actual proofs.
ko: 다음 항등식을 증명하세요. "sorry"를 실제 증명으로 대체하세요.

source: Prove these equivalences:
ko: 이 등가식들을 증명하세요.

source: Proving a fact like zero + m = m, however, requires a proof by induction.
ko: 하지만 zero + m = m같은 사실을 증명하는 것은 귀납에 의한 증명이 요구됩니다.

source: Rather, it is the fact that we can write them down and check that they are well-typed that ensures that the proposition in question is true.
ko: 그것보다 우리가 표현식을 쓰고 잘 쓰여졌는지 확인할 수 있다는 사실은 의문의 명제가 참인지를 확실히 만듭니다.

source: Raw natural numbers are not polymorphic.
ko: 생 자연수는 다형적이지 않습니다.

source: Recall also from Dependent Type Theory that to give these definitions the greatest generality possible, we allow the types α and β to belong to any universe.
ko: 종속 유형론으로부터 이들 정의에 가능한 가장 큰 일반성을 준 것을 기억하세요. 우리는 α형과 β형이 임의의 세계에 속함을 허용합니다.

source: Recall from the Conjunction section if p has type Point, the expression p.foo is interpreted as Point.foo p, assuming that the first non-implicit argument to foo has type Point.
ko: 결합 섹션(Conjunction section)에서 foo에 대한 첫 번째 비암시적인 인수가 Point형을 갖는다고 가정했을 때 만약 p가 Point형이면 표현식 p.foo는 Point.foo p으로 해석됨을 기억하세요.

source: Recall that #eval fib <n> is exponential on <n>.
ko: #eval fib <n>가 <n>에 대해 지수적이었음을 기억하세요.

source: Recall that a non-recursive inductive type that contains only one constructor is called a structure or record.
ko: 한 생성자만을 포함한 비 재귀적인 귀납형은 구조체(structure) 혹은 레코드(record)라고 불린다는 것을 떠올려보세요.

source: Recall that terms in the Calculus of Constructions have a computational interpretation, and that the logical framework treats terms with a common reduct as the same.
ko: 직관주의적 계산법의 항은 계산적인 해석을 갖고 논리 프레임워크는 공통 환원된 항을 같은 것으로 다룬는 것을 기억하세요.

source: Recall that the def keyword provides one important way of declaring new named objects.
ko: def가 새 이름을 가진 대상을 선언하는 중요한 방식임을 기억하세요.

source: Recall that the import command at the beginning of a file imports previously compiled results from other files, and that importing is transitive; if you import Foo and Foo imports Bar, then the definitions and theorems from Bar are available to you as well.
ko: 파일의 시작에서 import 명령은 다른 파일로부터 이전에 컴파일된 결과를 불러오고 그 불러오기는 추이적임을 기억하세요. 만약 여러분이 Foo를 가져오고 Foo가 Bar를 가져오면 Bar에서 이용가능한 정의와 정리도 여러분이 사용할 수 있습니다.

source: Recall that types may not have any elements in Lean.
ko: 유형은 린에서 임의의 원소가 아닐 수 있음을 기억하세요.

source: Recall that we can also write theorem t1 as follows:
ko: 우리는 정리 t1을 다음과 같이 쓸 수 있음을 기억하세요.

source: Recall that, in the case of ordinary function spaces, we could interpret α → β as the special case of (x : α) → β in which β does not depend on x.
ko: 평범한 함수공간의 경우에 대해 우리는 α → β을 (x : α) → β의 특별한 경우로 해석할 수 있음을 생각해보세요. 이때 β는 x에 의존하지 않습니다.

source: Recall the definition of even and odd as mutual inductive predicates, as presented as an example there:
ko: even과 odd을 상호적으로 귀납적인 술어의 정의로 호출한다면 다음 예제와 같이 나타날 것입니다.

source: Recall this tells Lean that the argument is implicit, and should be filled in automatically.
ko: 이것이 린에게 인수가 암시적이고 자동적으로 채우게 함을 의미한다는 것을 기억하세요.

source: Recursively define a function that evaluates any such term with respect to an assignment of values to the variables.
ko: 변수에 값을 할당한 것에 대한 항으로 계산하는 재귀적으로 함수를 정의하세요.

source: Reflexivity is more powerful than it looks.
ko: 대칭성은 보기 보다 더 강력합니다.

source: Remember also that in both the VS Code and Emacs editor modes, tab completion works in set_option, to help you find suitable options.
ko: 또한 VS Code 및 Emacs 편집기 모드에서 탭 완성 기능은 set_option에서 동작하므로 적절한 옵션을 찾는 데 도움이 됨을 기억하세요.

source: Remember that #check is often used in conjunction with the @ operator, which makes all of the arguments to a theorem or definition explicit.
ko: #check는 @ 연산자와 결합하여 종종 사용됨을 기억하세요. 이는 정리나 정의의 모든 인수를 명시적이게 합니다.

source: Remember that → associates to the right (nothing changes now that the arguments are elements of Prop, instead of some other Type), as do the other binary connectives.
ko: 다른 이항 결합자들처럼 →은 오른쪽으로 결합한다는 것을 기억하세요.(인수가 Type 대신 Prop인 것을 제외하고 변한 건 없습니다.)

source: Remember that expressions which differ up to renaming of bound variables are considered to be equivalent.
ko: 표현식들은 구속변수의 이름이 달라지기까지 동등한 것으로 간주된다는 것을 기억하세요.

source: Remember that identifiers in Lean can be organized into hierarchical namespaces.
ko: 린의 식별자들은 계층적인 이름공간 안에 정리될 수 있음을 기억하세요.

source: Remember that if you open Classical, you can use the law of the excluded middle for any proposition at all.
ko: 여러분이 open Classical을 하면 여러분은 임의의 명제에 대해서 배중률을 사용할 수 있음을 기억하세요.

source: Remember that the point of the variable command is to declare variables for use in theorems, as in the following example:
ko: variable 명령의 요점은 다음 예제에서 처럼 정리에서 사용하기 위한 변수를 선언하는 것임을 기억하세요.

source: Remember that the standard library defines notation α × β for Prod α β and (a, b) for Prod.mk a b.
ko: 표준 라이브러리는 Prod α β에 대해 α × β 표기를 정의하고 Prod.mk a b에 대해 (a, b)를 정의합니다.

source: Remember that this type can just as well be written ∀ (p q : Prop) (hp : p) (hq :q), p, since the arrow denotes nothing more than an arrow type in which the target does not depend on the bound variable.
ko: 왜냐하면 화살표는 대상이 구속 변수에 의존하지 않는 화살표 유형만을 나타내기 때문에 이 유형은 ∀ (p q : Prop) (hp : p) (hq :q), p로 쓸 수 있게 함을 기억하세요.

source: Remember that, without any parameters, an expression of type Prop is just an assertion.
ko: 어떤 매개변수도 없이 Prop형의 표현식은 그저 주장일 뿐이라는 걸 기억하세요.

source: Remember the introduction and elimination rules for dependent arrow types:
ko: 의존 화살표 유형에 대한 도입과 소거 규칙을 기억하세요.

source: Replace calling rustdoc --test from mdbook test with ./test
ko: mdbook test에서 rustdoc --test을 호출하는 것을 ./test으로 대체함.

source: Resolution theorem provers, tableau theorem provers, fast satisfiability solvers, and so on provide means of establishing the validity of formulas in propositional and first-order logic.
ko: Resolution 증명 보조기, tableau 증명 보조기, fast satisfiability 솔버 등등은 명제 논리식와 1계 논리식의 유효성을 식별하는 세우는 수단을 제공합니다.

source: Returning to the example of lists, you can use the command #check to inspect the type of the following List functions.
ko: 리스트의 예로 돌아가서 여러분은 다음 List 함수의 유형을 검사하기 위해 #check 명령을 사용할 수 있습니다.

source: Returning to the previous example and renaming bound variables for clarity, notice the types of the following expressions:
ko: 이전 예제로 돌아가 명확성을 위해 구속변수의 이름을 바꿉시다. 다음 표현식의 유형을 주목하세요.

source: Rewrites can be applied sequentially, so that the proof above can be shortened to this:
ko: 다시쓰기는 연속적으로 쓸 수 있습니다. 따라서 위의 증명은 이와 같이 더 짧아질 수 있습니다.

source: Rewriting
ko: 다시쓰기

source: Roughly speaking, what characterizes inductive types in Prop is that one can only eliminate to other types in Prop.
ko: 대략적으로 말하면, Prop에서 귀납형을 특징짓는 것은 Prop의 다른 유형으로만 제거할 수 있습니다.

source: Roughly speaking, an element of Prop is said to be decidable if we can decide whether it is true or false.
ko: 대략적으로 말하면 Prop의 원소는 그것이 참인지 거짓인지 결정할 수 있다면 결정 가능하다고 합니다.

source: Roughly speaking, each ... can be any arrow type constructed from Foo and previously defined types, in which Foo appears, if at all, only as the "target" of the dependent arrow type.
ko: 대략적으로 말하자면 각 ...는 의존 화살표 형의 "대상"으로만 Foo및 이전에 정의된 유형으로 구성된 모든 화살표 유형이 될 수 있습니다.

source: Roughly speaking, since we know there is an x satisfying p x, we can give it a name, say, w.
ko: 대략 말하자면 p x를 만족하는 x가 있다는 것을 알기 때문에 이것에 w라는 이름을 줄 수 있다는 것입니다.

source: Roughly, an element of Inhabited α is a witness to the fact that there is an element of α; in the Chapter Type Classes we will see that Lean can be instructed that suitable base types are inhabited, and can automatically infer that other constructed types are inhabited.
ko: 대략적으로 Inhabited α의 원소는 α의 원소가 있다는 사실의 목격자입니다. 유형 클래스 장에서 우리는 린이 적절한 기반 유형이 머물러 있고, 자동적으로 다른 생성 유형이 머물러 있는지 추론하는 것을 배울 수 있음을 볼 예정입니다.

source: Run mdbook test to test all lean code blocks.
ko: 모든 lean의 코드 블록을 테스트하려면 mdbook test을 실행하세요.

source: Scoped Instances
ko: 범위가 지정된 개체

source: Second, when writing type expressions, arrows associate to the right; for example, the type of Nat.add is Nat → Nat → Nat which is equivalent to Nat → (Nat → Nat).
ko: 둘째로 유형 표현식을 쓸 때 화살표는오른쪽 먼저 결합합니다. 가령Nat.add의 유형은 Nat → Nat → Nat이고 이는 Nat → (Nat → Nat)과 동등합니다.

source: Sections are also useful for delimiting the scope of commands such as set_option and open.
ko: section은 set_option과 open같이 명령의 범위를 제한하는데 유용합니다.

source: Sections can also be nested, which allows you to declare new variables incrementally.
ko: section은 중첩될 수도 있습니다. 이는 여러분에게 새로운 변수를 점진적으로 선언할 수 있게 합니다.
